MESSAGES = {
    'start': 'Вітаємо у Telegram-боті від KPI Notify! Ви зможете отримувати нагадування про свої події тут',
    'no_username': 'У вас немає імені користувача Telegram',
    'ask_phone': 'Надішліть свій номер телефону, щоб ми могли вас знайти',
    'verification_successful': 'Ваші дані було успішно верифіковано! Оберіть метод нагадування Telegram, щоб отримувати нагадування про свої події у цьому чаті',
    'already_verified': 'Ви вже верифіковані',
    'ask_verification': 'Верифікуйте себе щоб отримувати нагадування про свої події у цьому чаті'
}

def user_not_found(username=None, phone=None):
    if username:
        return f'Користувача {username} не знайдено. Спробуйте надіслати номер телефону'
    if phone:
        return f'Не вдалося знайти користувача з номером {phone}'
    return 'Користувача не знайдено. Спробуйте інший спосіб ідентифікації'
